IDENTIFICATION DIVISION.
PROGRAM-ID. hello.
ENVIRONMENT DIVISION.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
     SELECT InputFile ASSIGN TO "input.txt"
         ORGANIZATION IS LINE SEQUENTIAL.
 
DATA DIVISION.
FILE SECTION.
FD InputFile.
01 TreeLine PIC X(31).
WORKING-STORAGE SECTION.
01 END-OF-FILE PIC Z(1).
01 COUNTER PIC 9(2).
01 X-OFFSET PIC 9(2).
01 TREES PIC 9(3).

PROCEDURE DIVISION.
 Begin.
    OPEN INPUT InputFile
    READ InputFile
       AT END MOVE 1 TO END-OF-FILE
    END-READ
    
    IF END-OF-FILE = 1
      CLOSE InputFile
    END-IF
    
    MOVE 0 TO END-OF-FILE.
    
    PERFORM UNTIL END-OF-FILE = 1
       COMPUTE X-OFFSET = FUNCTION SUM(COUNTER, 1)
    *>    DISPLAY TreeLine (X-OFFSET:1) SPACE X-OFFSET
       IF TreeLine (X-OFFSET:1) = "#"
           ADD +1 TO TREES
       END-IF
       ADD +3 TO COUNTER
       COMPUTE COUNTER = FUNCTION MOD(COUNTER, 31)
       READ InputFile
          AT END MOVE 1 TO END-OF-FILE
       END-READ
    END-PERFORM
    CLOSE InputFile
    DISPLAY "Total Trees:" SPACE TREES
 STOP RUN.

END PROGRAM hello.
